# -------------------------------------------------------
# 1. Append use specific Brewfile for work or private
# 1. run 'brew bundle --file $HOME/dotfiles/setup_scripts/Brewfile'
#     to install these packages
# -------------------------------------------------------

# tapでリポジトリを指定
tap 'homebrew/bundle'

brew 'git'
brew 'gh'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'tmux'
brew 'autojump'
brew 'mas'
brew 'firebase-cli'
brew 'vim' # I don't use Mac installed vim, because I need python3 supported vim for UltiSnippet.

# these for gatsbyjs in M1 Mac
# ref: https://qiita.com/yudwig/items/c533f676b7b8015da723
brew 'pkg-config'
brew 'glib'
brew 'zlib'
brew 'libjpeg-turbo'
brew 'libpng'
brew 'webp'
brew 'vips' # know as libvips

brew 'rbenv'
brew 'ruby-build'
brew 'nvm' # node version manager
brew 'python3'
brew 'rust'

# peco (ref: http://qiita.com/xtetsuji/items/05f6f4c1b17854cdd75b)
brew 'peco'

brew 'ag'
brew 'the_silver_searcher'
brew 'jq'

tap 'homebrew/cask-fonts'
cask 'font-ricty-diminished'

# tile manager
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'

# for AWS Commandline Interface
brew 'awscli'

brew 'terraform'

brew 'mysql'
brew 'redis'
brew 'planetscale/tap/pscale'
# planetscale requires this for for certain commands.
brew 'mysql-client'

brew 'httperf'
brew 'wget'
brew 'watch'
brew 'htop'
brew 'git-delta'
brew 'exa'

# M1 Mac対応するまではDocker-DesktopをGUIから普通にインストールする
# brew 'docker'
# 下記の説明を見ると、Doker-Desktop使うならもうdocker-machineは必要無いかも
# https://docs.docker.jp/machine/overview.html#what-is-docker-machine
# brew 'docker-machine'
brew 'minikube'

# for risc-v and xv6
tap  'riscv/riscv'
brew 'riscv-tools'

# to create os
brew 'qemu'
brew 'nasm'
brew 'bochs'

brew 'telegraf'

# for my own keyboard
brew 'qmk/qmk/qmk'
# for qmk-toolbox
tap 'homebrew/cask-drivers'
cask 'qmk-toolbox'

# Install with homebrew-casks
# Available apps: https://github.com/phinze/homebrew-cask/tree/master/Casks
cask_args appdir: "/Applications"
cask 'alfred'
cask 'dash'
cask 'appcleaner'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'macvim'
cask 'sequel-pro'
cask 'iterm2'
cask 'slack'
cask 'zoom'
cask 'lastpass'
cask 'kindle'
cask 'notion'
cask 'hey'
cask 'cmd-eikana' # ⌘英かな
# とりあえず書いてるけど2021年3月20日時点では、brew経由ではM1 Mac対応のdocker-desktopはダウンロード出来ないので
# https://docs.docker.com/docker-for-mac/apple-m1/ からM1 Mac対応の Docker Desktop RC 1(2021-03-18 published)を
# インストールした
# cask 'docker' # docker-desktop

# (M1 Macと?)互換性がないので使えないというエラーが出たので
# Brewfileではインストールしない。手動でインストールすること
# mas 'Trello', id: 461504587
mas 'TweetDeck', id: 485812721

# append brew settings on the situation. private or work
# Brewfile only for private use

cask 'dropbox'
cask 'vagrant'
cask 'virtualbox'
