# -------------------------------------------------------
# 1. Append use specific Brewfile for work or private
# 1. run 'brew bundle --file $HOME/dotfiles/setup_scripts/Brewfile'
#     to install these packages
# -------------------------------------------------------

# tapでリポジトリを指定
tap 'homebrew/bundle'

brew 'git'
brew 'gh'
brew 'zsh'
brew 'tmux'
brew 'autojump'
brew 'mas'

brew 'rbenv'
brew 'ruby-build'
brew 'nvm' # node version manager
brew 'python3'

# peco (ref: http://qiita.com/xtetsuji/items/05f6f4c1b17854cdd75b)
brew 'peco'

brew 'ag'
brew 'the_silver_searcher'
brew 'jq'

tap 'homebrew/cask-fonts'
brew 'ricty'
cask 'font-ricty-diminished'

# for AWS Commandline Interface
brew 'awscli'

brew 'circleci'

brew 'mysql'
brew 'redis'

brew 'httperf'
brew 'wget'
brew 'watch'
brew 'htop'

brew 'docker-machine'

# for risc-v and xv6
tap  'riscv/riscv'
brew 'riscv-tools'

# to create os
brew 'qemu'
brew 'nasm'
brew 'bochs'

# brew 'telegraf'

# Install with homebrew-casks
# Available apps: https://github.com/phinze/homebrew-cask/tree/master/Casks
cask_args appdir: "/Applications"
cask 'alfred'
cask 'dash'
cask 'appcleaner'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'macvim'
cask 'sequel-pro'
cask 'iterm2'
cask 'hammerspoon'
cask 'cmd-eikana' # ⌘英かな
cask 'slack'

mas 'Airmail 4', id: 918858936
mas 'Pocket', id: 568494494

# append brew settings on the situation. private or work
