# -------------------------------------------------------
# run 'brew bundle --file $HOME/dotfiles/setup_scripts/Brewfile'
#   to install these packages
# -------------------------------------------------------

# tapでリポジトリを指定
tap 'homebrew/bundle'

brew 'git'
brew 'gh'
brew 'zsh'
brew 'mas'

brew 'rbenv'
brew 'ruby-build'
brew 'node'
brew 'nvm'
brew 'python3'

# peco (ref: http://qiita.com/xtetsuji/items/05f6f4c1b17854cdd75b)
brew 'peco'

brew 'ag'
brew 'the_silver_searcher'
brew 'jq'

tap 'homebrew/cask-fonts'
brew 'ricty'
cask 'font-ricty-diminished'

# for AWS Commandline Interface
brew 'awscli'

brew 'circleci'

brew 'mysql'
brew 'redis'

brew 'httperf'
brew 'wget'
brew 'watch'
brew 'htop'

brew 'docker-machine'

# brew 'telegraf'

# Install with homebrew-casks
# Available apps: https://github.com/phinze/homebrew-cask/tree/master/Casks
cask_args appdir: "/Applications"
cask 'alfred'
cask 'dash'
cask 'appcleaner'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
#cask 'heroku-toolbelt'
cask 'libreoffice'
cask 'macvim'
cask 'sequel-pro'
cask 'skype'
cask 'vagrant'
cask 'virtualbox'
cask 'iterm2'
cask 'hammerspoon'
cask 'cmd-eikana' # ⌘英かな
cask 'slack'

mas 'Airmail 4', id: 918858936
